app/views/home/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
      <p class="card-text"><%= i.content %> </p>
      <p class="card-subtitle mb-2 text-muted"><em>de <%= i.user.first_name %></em></p>