app/views/static/index.html.erb

      <p class="card-text"><%= i.content %> </p>
      <p class="card-subtitle mb-2 text-muted"><em>de <%= i.user.first_name %></em></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]