app/controllers/users_controller.rb

SELECT "cities".* FROM "cities"
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new('first_name' => params[:first_name],
    	             'last_name' => params[:last_name],
    	             'description' => params[:description],
    	             'email' => params[:email],
    	             'age' => params[:age],
    	             'password' => params[:password],
    	             'password_confirmation' => params[:password_confirmation],
    	             'city_id' => City.all.sample.id)
    if @user.save